/************************************************************************
* 當點擊這個按鈕時，自動捲動到網頁最上方，0.333秒完成捲動的動作
* 當瀏覽器的捲軸在移動時，執行 $(window).scroll
*     判斷網頁可視範圍的最上方距離網頁頂端是否超過 150 px
*     超過 150 px，以0.222秒的特效顯示按鈕
*     未超過 150 px，先停止正在進行的特效，接著以 0.222 秒的特效隱藏按鈕
*************************************************************************/

$(function(){
	$('#GoTop').click(function(){ 
		$('html,body').animate({scrollTop:0}, 333);
	});
	$(window).scroll(function() {
		if ( $(this).scrollTop() > 150 ){
			$('#GoTop').fadeIn(222);
		} else {
			$('#GoTop').stop().fadeOut(222);
		}
	}).scroll();
});
